feat(theme): upgraded theme to hope
